tutorials/twoPhaseStratifiedFlow/meshB/constant/extrudeProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// What to extrude:
//      patch   : from patch of another case ('sourceCase')
//      mesh    : as above but with original case included
//      surface : from externally read surface

//constructFrom mesh;
constructFrom patch;
//constructFrom surface;

// If construct from patch/mesh:
sourceCase ".";
sourcePatch lowerWedge;

// If construct from patch: patch to use for back (can be same as sourcePatch)
exposedPatchName upperWedge;

// Flip surface normals before usage. Valid only for extrude from surface or
// patch.
flipNormals false;

//- Wedge extrusion of a single layer
//  with wedge patches on front and back
extrudeModel        wedge;

nLayers             1;

expansionRatio      1.0;

wedgeCoeffs
{
    axisPt      (0 0 0);
    axis        (0 1 0);
    angle       10.0;//2.5; 
}

// Do front and back need to be merged? Usually only makes sense for 360
// degree wedges.
mergeFaces false;

// Merge small edges. Fraction of bounding box.
mergeTol 1e-05;


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
